assembler.tex
% Created 2022-07-08 Fri 13:04
\documentclass[minimal, t]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\author{Dr Carey Pridgeon}
\date{\today}
\title{Introduction To Assembler}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 25.3.50.1 (Org mode 8.2.10)}}
\begin{document}

\maketitle
\section{1.         Introduction To Assembler on X86 processors}
\label{sec-1}

\begin{itemize}
\item Start a C project, in whatever environment you have available called
assembler. The only limiting factor is this environment must allow you to
enter the compilation commands directly. To complete this worksheet you will
need a single C source file, and a text editor. Which one doesn’t matter.

\item add a file to your project called main.c.
\item To create it you can either start a new file in your text editor or if you’re
on Linux or a Mac, make a new empty file my typing touch main.c and opening
that. Either method works the same.
\item Add this to it:
\end{itemize}
\begin{verbatim}
int main() {
return 0;
}
\end{verbatim}
\begin{itemize}
\item Then save and compile the resulting file. The Compilation command is:
\item \textbf{gcc -S main.c}
\item If all goes well this will finish.  The \textbf{-S} tells the compiler you want it to
output the compilation results in assembly language, not the native binary
used by your computers hardware.
\item Typing \textbf{ls} will show you have succeeded in generating a file called main.s
that contains the assembler version of your c code.
\item Read the output by loading \textbf{main.s}.
\end{itemize}
using the command \textbf{nano main.s}
\begin{verbatim}
	.file   "main.c"
	.text
	.globl  main
	.type   main, @function
main:
.LFB0:
	.cfi_startproc
	pushq   %rbp
	.cfi_def_cfa_offset 16
	.cfi_offset 6, -16
	movq    %rsp, %rbp
	.cfi_def_cfa_register 6
	movl    $0, %eax
	popq    %rbp
	.cfi_def_cfa 7, 8
	ret
	.cfi_endproc
.LFE0:
	.size   main, .-main
	.ident  "GCC: (Ubuntu 4.8.4-2ubuntu1~14.04.3) 4.8.4"
	.section        .note.GNU-stack,"",@progbits
\end{verbatim}
\begin{itemize}
\item This assembler is just setting up the process to run.
\item Use this output as a baseline to compare against for further exercises.
\item The section that has the new code (beyond fundamental setup and process
closing) is:
\end{itemize}
\begin{verbatim}
.cfi_def_cfa_register 6
// new code will be here
movl    $0, %eax
\end{verbatim}
\begin{itemize}
\item Next we will be typing code in the main function that actually does
something, so in the gap above
\textbf{return 0;}
\item Add this code:
\end{itemize}

\begin{verbatim}
int a = 2;
\end{verbatim}

\begin{itemize}
\item Save and compile the code again, then inspect the output as before.
\end{itemize}

\begin{verbatim}
	.file   "main.c"
	.text
	.globl  main
	.type   main, @function
main:
.LFB0:
	.cfi_startproc
	pushq   %rbp
	.cfi_def_cfa_offset 16
	.cfi_offset 6, -16
	movq    %rsp, %rbp
	.cfi_def_cfa_register 6
	movl    $2, -4(%rbp)
	movl    $0, %eax
	popq    %rbp
	.cfi_def_cfa 7, 8
	ret
	.cfi_endproc
.LFE0:
	.size   main, .-main
	.ident  "GCC: (Ubuntu 4.8.4-2ubuntu1~14.04.3) 4.8.4"
	.section        .note.GNU-stack,"",@progbits
\end{verbatim}

\begin{itemize}
\item So now the code
\end{itemize}

\begin{verbatim}
movl    $2, -4(%rbp)
\end{verbatim}
\begin{itemize}
\item Has appeared.
\item This is assembler storing the literal value 2 (\emph{\$} means
literal) in the variable we have decided to call \textbf{a} in one of its
15 counting registers, in the fourth one along specifically and
exited.

\item So lets retrieve and increment the variable next
\end{itemize}
\begin{verbatim}
a = a+5;
\end{verbatim}
\begin{itemize}
\item Now we get, after recompiling main.c:
\end{itemize}
\begin{verbatim}
movl    $2, -4(%rbp)
addl    $5, -4(%rbp)
\end{verbatim}
\begin{itemize}
\item So now we see that the value in -4(\%rbp) has had the literal value 5
added to it.
\item So, lets add a new variable to the program
\end{itemize}

\begin{verbatim}
int b = 0;
\end{verbatim}
\begin{itemize}
\item This now gives us
\end{itemize}

\begin{verbatim}
movl    $2, -8(%rbp)
movl    $0, -4(%rbp)
addl    $5, -8(%rbp)
\end{verbatim}
\begin{itemize}
\item So the 8th register in \%rbp has been initialised with 0.

\item So far we've only worked with literals, lets add a to b.
\item add the line
\end{itemize}
\begin{verbatim}
b+=a;
\end{verbatim}

\begin{verbatim}
movl    $2, -8(%rbp)
movl    $0, -4(%rbp)
addl    $5, -8(%rbp)
movl    -8(%rbp), %eax
addl    %eax, -4(%rbp)
\end{verbatim}
\begin{itemize}
\item Now the value in \textbf{-4(\%rbp)} (our \textbf{a} variable), has been moved into
\textbf{\%eax} register (an accumulator), from there it has been added to \textbf{-8(\%rbp)}
(our \textbf{b} variable).
\end{itemize}
\subsection{Subtraction}
\label{sec-1-1}
\begin{itemize}
\item Add the code
\end{itemize}
\begin{verbatim}
int c = b - 3;
\end{verbatim}
\begin{itemize}
\item Recompile, and our assembly block becomes
\end{itemize}
\begin{verbatim}
movl    $2, -12(%rbp)
movl    $0, -8(%rbp)
addl    $5, -12(%rbp)
movl    -12(%rbp), %eax
addl    %eax, -8(%rbp)
movl    -8(%rbp), %eax
subl    $3, %eax
movl    %eax, -4(%rbp)
\end{verbatim}
\begin{itemize}
\item Of which the new code is
\end{itemize}
\begin{verbatim}
movl    -8(%rbp), %eax
subl    $3, %eax
movl    %eax, -4(%rbp)
\end{verbatim}
\begin{itemize}
\item The value in \textbf{-8(\%rbp)} is moved into \textbf{eax}
\item The literal value 3 is subtracted from it, and the result is stored
in the register \textbf{-4(\%rbp)} as our new variable \textbf{c}.
\end{itemize}
\subsection{Looping}
\label{sec-1-2}
\begin{itemize}
\item In programming we often need to repeat operations. For this we use
several forms of loop.
\item We will add a simple for loop to our program so we can examine it
in assembler.
\end{itemize}
\begin{verbatim}
int i;                                                                                                    
for (i=0;i<5;i++) {                                      
  c+=2;                                       
}
\end{verbatim}

\begin{itemize}
\item Edit your c program adding a new var \textbf{i} to
use in the for loop, and a loop that adds \textbf{1} to \textbf{c} five times.
\item Compile, then view the assembler.
\item You will see the places variables are stored has moved. This is
because the compiler is deciding where to store things, not us.
\item The new block of interest is:
\end{itemize}
\begin{verbatim}
	movl    $0, -12(%rbp)
	jmp     .L2
.L3:
	addl    $2, -16(%rbp)
	addl    $1, -12(%rbp)
.L2:
	cmpl    $4, -12(%rbp)
	jle     .L3
\end{verbatim}
\subsection{Looping - Line by Line}
\label{sec-1-3}
\begin{verbatim}
movl    $0, -12(%rbp)
\end{verbatim}
\begin{itemize}
\item This is a for loop, so first line of assembler sets up the loop control var
\textbf{i}.
\end{itemize}
\begin{verbatim}
addl    $2, -16(%rbp)
jmp     .L2
\end{verbatim}
\begin{itemize}
\item Loops in assembler work by jumping around the code, using labels to
set destination points.
\item This loop starts by jumping to label L2.
\end{itemize}
\begin{verbatim}
.L2:
	cmpl    $4, -4(%rbp)
	jle     .L3
\end{verbatim}
\begin{itemize}
\item At L2 there is a comparison to see whether the loop has ended (is
i still less than or equal to 4).
\end{itemize}
\begin{verbatim}
jle     .L3
\end{verbatim}
\begin{itemize}
\item \textbf{jle} means 'Jump if less than or equal' The jump target is L3,
which contains the logic the loop is performing (minimal in this example).
\end{itemize}
\begin{verbatim}
.L3:
	addl    $2, -8(%rbp)
	addl    $1, -4(%rbp)
\end{verbatim}
\begin{itemize}
\item Here 2 is being added to \textbf{-8(\%rbp)} (var \textbf{c}), and one is being
added to the iteration varable \textbf{i} \textbf{-4(\%rbp)}
\item The loop ends when \textbf{jle} returns false (\textbf{i>4}).
\end{itemize}
% Emacs 25.3.50.1 (Org mode 8.2.10)
\end{document}